In [9]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame, Index

pd.set_option('display.notebook_repr_html', False)

df1 = pd.DataFrame(np.random.rand(3,3))
df1

          0         1         2
0  0.456469  0.258318  0.405348
1  0.895355  0.518589  0.293546
2  0.140776  0.510068  0.602467

In [10]:
df1[1]

0    0.258318
1    0.518589
2    0.510068
Name: 1, dtype: float64

In [11]:
df1[2]

0    0.405348
1    0.293546
2    0.602467
Name: 2, dtype: float64

In [12]:
df1.loc[1]

0    0.895355
1    0.518589
2    0.293546
Name: 1, dtype: float64

In [13]:
df1.iloc[1]

0    0.895355
1    0.518589
2    0.293546
Name: 1, dtype: float64

In [14]:
df1.0

SyntaxError: invalid syntax (2397823455.py, line 1)

In [ ]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame, Index


series_kr = pd.Series(np.arange(0,5,1), index=['seoul', 'pusan', 'incheon', 'daejeon', 'daegu'])
series_jp = pd.Series(np.arange(0,10,2), index=['tokyo', 'osaka', 'sendai', 'yamagata', 'yonezawa'])

cities_asia = pd.DataFrame({'korea': series_kr, 'japan': series_jp})
cities_asia

          korea  japan
daegu       4.0    NaN
daejeon     3.0    NaN
incheon     2.0    NaN
osaka       NaN    2.0
pusan       1.0    NaN
sendai      NaN    4.0
seoul       0.0    NaN
tokyo       NaN    0.0
yamagata    NaN    6.0
yonezawa    NaN    8.0

In [ ]:
cities_asia['korea']

daegu       4.0
daejeon     3.0
incheon     2.0
osaka       NaN
pusan       1.0
sendai      NaN
seoul       0.0
tokyo       NaN
yamagata    NaN
yonezawa    NaN
Name: korea, dtype: float64

In [ ]:
cities_asia.korea

daegu       4.0
daejeon     3.0
incheon     2.0
osaka       NaN
pusan       1.0
sendai      NaN
seoul       0.0
tokyo       NaN
yamagata    NaN
yonezawa    NaN
Name: korea, dtype: float64

In [ ]:
cities_asia.loc['tokyo']

korea    NaN
japan    0.0
Name: tokyo, dtype: float64

In [ ]:
cities_asia.iloc[7]

korea    NaN
japan    0.0
Name: tokyo, dtype: float64

In [ ]:
# 슬라이싱
cities_asia.iloc[:3, :2]

         korea  japan
daegu      4.0    NaN
daejeon    3.0    NaN
incheon    2.0    NaN

In [ ]:
cities_asia.iloc[2,0] = 12

In [ ]:
cities_asia.iloc[:3, :]

         korea  japan
daegu      4.0    NaN
daejeon    3.0    NaN
incheon    2.0    NaN

cities_asia.iloc[:3, :]

In [ ]:
cities_asia.iloc[:3]

         korea  japan
daegu      4.0    NaN
daejeon    3.0    NaN
incheon    2.0    NaN

In [ ]:
cities_asia[cities_asia.korea > 10]

         korea  japan
incheon   12.0    NaN

In [ ]:
#cities_asia[ cities_asia[:, 'daegu'] > 1]

# 슬라이싱으로 정렬하기

In [ ]:
cities_asia

          korea  japan
daegu       4.0    NaN
daejeon     3.0    NaN
incheon     2.0    NaN
osaka       NaN    2.0
pusan       1.0    NaN
sendai      NaN    4.0
seoul       0.0    NaN
tokyo       NaN    0.0
yamagata    NaN    6.0
yonezawa    NaN    8.0

In [ ]:
cities_asia.iloc[::2]

          korea  japan
daegu       4.0    NaN
incheon     2.0    NaN
pusan       1.0    NaN
seoul       0.0    NaN
yamagata    NaN    6.0

In [ ]:
cities_asia[::-1]

          korea  japan
yonezawa    NaN    8.0
yamagata    NaN    6.0
tokyo       NaN    0.0
seoul       0.0    NaN
sendai      NaN    4.0
pusan       1.0    NaN
osaka       NaN    2.0
incheon     2.0    NaN
daejeon     3.0    NaN
daegu       4.0    NaN

In [ ]:
cities_asia[::-3]

          korea  japan
yonezawa    NaN    8.0
seoul       0.0    NaN
osaka       NaN    2.0
daegu       4.0    NaN

In [ ]:
cities_asia.index

Index(['daegu', 'daejeon', 'incheon', 'osaka', 'pusan', 'sendai', 'seoul',
       'tokyo', 'yamagata', 'yonezawa'],
      dtype='object')

In [ ]:
cities_asia.columns

Index(['korea', 'japan'], dtype='object')

In [ ]:
cities_asia.values

array([[ 4., nan],
       [ 3., nan],
       [12., nan],
       [nan,  2.],
       [ 1., nan],
       [nan,  4.],
       [ 0., nan],
       [nan,  0.],
       [nan,  6.],
       [nan,  8.]])

In [ ]:
cities_asia.values[1]

array([ 3., nan])

In [ ]:
cities_asia['korea']

daegu        4.0
daejeon      3.0
incheon     12.0
osaka        NaN
pusan        1.0
sendai       NaN
seoul        0.0
tokyo        NaN
yamagata     NaN
yonezawa     NaN
Name: korea, dtype: float64

In [ ]:
cities_asia['japan']

daegu       NaN
daejeon     NaN
incheon     NaN
osaka       2.0
pusan       NaN
sendai      4.0
seoul       NaN
tokyo       0.0
yamagata    6.0
yonezawa    8.0
Name: japan, dtype: float64

In [ ]:
#전치
cities_asia.T

,daegu,daejeon,incheon,osaka,pusan,sendai,seoul,tokyo,yamagata,yonezawa
korea,4.0,3.0,12.0,NaN,1.0,NaN,0.0,NaN,NaN,NaN
japan,NaN,NaN,NaN,2.0,NaN,4.0,NaN,0.0,6.0,8.0

In [ ]:
cities_asia.iloc[:3, :2]

         korea  japan
daegu      4.0    NaN
daejeon    3.0    NaN
incheon   12.0    NaN

In [ ]:
#마스킹
cities_asia[cities_asia.korea > 10]

         korea  japan
incheon   12.0    NaN

# NumPy로 DataFrame만들어보기

In [ ]:
pd.DataFrame(np.random.rand(3,2), columns=['korea','japan'], index=['c1', 'c2', 'c3'])

       korea     japan
c1  0.195922  0.921633
c2  0.139917  0.870717
c3  0.616053  0.029859

In [ ]:
df1 = pd.DataFrame(np.random.rand(3,3))
df1

          0         1         2
0  0.312565  0.183003  0.561118
1  0.963826  0.955727  0.356596
2  0.955699  0.596940  0.381478

In [ ]:
df1[0]

0    0.312565
1    0.963826
2    0.955699
Name: 0, dtype: float64

In [ ]:
#
cities_asia[cities_asia.korea > 10]

# Index 알아보기

In [ ]:
idx1 = pd.Index(np.arange(10))
idx1

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9], dtype='int64')

In [ ]:
idx1[2]

2

In [ ]:
idx1[::3]

Int64Index([0, 3, 6, 9], dtype='int64')

In [ ]:
idx1.shape

(10,)

In [ ]:
idx1[ idx1 < 5]

Int64Index([0, 1, 2, 3, 4], dtype='int64')

In [ ]:
idx1.

SyntaxError: invalid syntax (3049699410.py, line 1)